## ✅ Plan Succeeded

**Deployment:** `383878a1-5366-412c-bcf2-b07b6eb851c0`

| Add | Change | Destroy |
|:---:|:------:|:-------:|
| 0 | 0 | 0 |

<details>
<summary>Show Plan Output</summary>

```hcl
FullRestore Sandbox Container
OpenTofu version: OpenTofu v1.11.2
Workspace: /workspace

Initializing the backend...

Initializing provider plugins...
- Finding digitalocean/digitalocean versions matching "~> 2.78.0"...
- Installing digitalocean/digitalocean v2.78.0...
- Installed digitalocean/digitalocean v2.78.0 (signed, key ID F82037E524B9C0E8)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that OpenTofu can guarantee to make the same selections by default when
you run "tofu init" in the future.

OpenTofu has been successfully initialized!
Success! The configuration is valid.

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # digitalocean_app.svelte_mine_game will be created
  + resource "digitalocean_app" "svelte_mine_game" {
      + active_deployment_id = (known after apply)
      + created_at           = (known after apply)
      + default_ingress      = (known after apply)
      + deployment_per_page  = 20
      + id                   = (known after apply)
      + live_domain          = (known after apply)
      + live_url             = (known after apply)
      + project_id           = (known after apply)
      + updated_at           = (known after apply)
      + urn                  = (known after apply)

      + dedicated_ips (known after apply)

      + spec {
          + disable_edge_cache              = false
          + disable_email_obfuscation       = false
          + domains                         = (known after apply)
          + enhanced_threat_control_enabled = false
          + features                        = (known after apply)
          + name                            = "svelte-mine-game"
          + region                          = "nyc"

          + domain (known after apply)

          + ingress (known after apply)

          + service {
              + build_command      = "npm run build"
              + environment_slug   = "node-js"
              + http_port          = 3000
              + instance_count     = 1
              + instance_size_slug = "basic-xxs"
              + internal_ports     = (known after apply)
              + name               = "web"
              + run_command        = "node build"

              + github {
                  + branch         = "main"
                  + deploy_on_push = true
                  + repo           = "douglasswm/svelte-mine-game"
                }

              + routes {
                  + path = "/"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_created_at  = (known after apply)
  + app_id          = (known after apply)
  + app_url         = (known after apply)
  + app_urn         = (known after apply)
  + default_ingress = (known after apply)
╷
│ Warning: Argument is deprecated
│ 
│   with digitalocean_app.svelte_mine_game,
│   on main.tf line 32, in resource "digitalocean_app" "svelte_mine_game":
│   32:       routes {
│ 
│ Service level routes are deprecated in favor of ingresses
╵
```

</details>

---
*To apply: Approve and merge this PR, or comment `fullrestore apply`*